Revit 2027 API
ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropService Property
 The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId DuctFittingAndAccessoryPressureDropService { get; }
Public Shared ReadOnly Property DuctFittingAndAccessoryPressureDropService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ DuctFittingAndAccessoryPressureDropService {
	ExternalServiceId^ get ();
}
static member DuctFittingAndAccessoryPressureDropService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace